.emacs.d/myinit.org
#+STARTIP: overview
* Basic org commands
"<s" begin/end src
#+BEGIN_SRC emacs-lisp
;;org mode run code C-c C-c
;;(fset 'yes-or-no-p 'y-or-n-p)
;;(global-set-key (kbd "<f5>") 'revert-buffer)
#+END_SRC


* Basic emacs setup
** Backup control
#+BEGIN_SRC emacs-list
;;Enable Backups
(setq make-backup-files t) 
(setq version-control t);;Last 5 versions of file saved

;;Silently delete old back up version of files
(setq delete-old-versions t)

;;Backup saved to this location
(setq backup-directory-alist (quote ((".*" . "~/.emacs_backups/"))))
#+END_SRC

** Basic custom keyboard keys
#+BEGIN_SRC emacs-lisp
;;remapping keys
(global-set-key (kbd "<left>") 'backward-word)
(global-set-key (kbd "<right>") 'forward-word)
(global-set-key (kbd "<up>") 'backward-paragraph)
(global-set-key (kbd "<down>") 'forward-paragraph)
#+END_SRC


* Packages
** smex
#+BEGIN_SRC emacs-lisp
;;Turn on smex for better M-x
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
#+END_SRC
** Yasnippet
#+BEGIN_SRC emacs-lisp
;;Yasnippet global mode
(yas-global-mode 1)
#+END_SRC

** auto-complete
#+BEGIN_SRC emacs-list
;;auto-complete configuration
(ac-config-default)
#+END_SRC

** autopair
#+BEGIN_SRC emacs-lisp
;;autopair
(autopair-global-mode)
#+END_SRC
** column marker
#+BEGIN_SRC emacs-lisp
;;column marker
(require 'column-marker)
(add-hook 'c++-mode-hook (lambda () (interactive) (column-marker-3 80)))
(add-hook 'python-mode-hook (lambda () (interactive) (column-marker-3 80)))
(add-hook 'latex-mode-hook (lambda () (interactive) (column-marker-3 80)))
;;C-u 80 M-x column-marker-3

;;Set fill column
(setq-default fill-column 80)
#+END_SRC

** which key
#+BEGIN_SRC emacs-lisp
;;Which key mode!  type C-x and wait to see available keys
(which-key-mode)
#+END_SRC

** swiper
#+BEGIN_SRC emacs-lisp
;;swiper recommended setup
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
;;(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key read-expression-map (kbd "C-r") 'counsel-expression-history)

#+END_SRC

** Ace window
#+BEGIN_SRC emacs-lisp
;;Ace window setup
(global-set-key [remap other-window] 'ace-window)

#+END_SRC

** Undo tree
#+BEGIN_SRC emacs-lisp
;;Undo tree use C-x u to bring up undo tree
(global-undo-tree-mode)

#+END_SRC
** Fly check
#+BEGIN_SRC emacs-lisp
;;Fly check
(global-flycheck-mode t)

#+END_SRC


* c++ 
** Add c++ file types
#+BEGIN_SRC emacs-lisp
;;Add files to c++ mode
(add-to-list 'auto-mode-alist '("\\.opt\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.dat\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))

#+END_SRC


* latex mode
** force spell check
#+BEGIN_SRC emacs-lisp
;;latex-preview
;;(latex-preview-pane-enable);;activate with M-x latex-preview-pane-mode
;;(flyspell-mode);;flyspell for checking spelling
;;texlive info is under /usr/local/texlive/texmf-local
(add-hook 'latex-mode-hook 'flyspell-mode)
#+END_SRC


* Not used
#+BEGIN_SRC emacs-lisp
;;Enable ido helps to auto-complete C-x C-f
;;(require 'ido)
;;(ido-mode t)

;;autopair is used currently for this
;;(require 'skeleton)
;;(setq skeleton-pair t)
;;(global-set-key (kbd "(") 'skeleton-pair-insert-maybe)
;;(global-set-key (kbd "\"") 'skeleton-pair-insert-maybe)
;;(global-set-key (kbd "[") 'skeleton-pair-insert-maybe)
;;(global-set-key (kbd "{") 'skeleton-pair-insert-maybe)
;;(global-set-key (kbd "'") 'skeleton-pair-insert-maybe)
#+END_SRC










